import { Fragment } from "react";

const About = () => {
  return (
    <Fragment>
      <h1 className="w-full text-2xl">
        بهترین سبک طراحی وبسایت در سال 2024 چیست ؟
      </h1>
      <p className="text-[#AAAAAA] leading-9">
        لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده
        از طراحان گرافیک است گرها و متون بلکه روزنامه و مجله در ست...لورم ایپسوم
        متن ساختگی با تولید سادگی نامف...لورم ایپسوم متن ساختگی با تولید سادگی
        نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است گرها و متون بلکه
        روزنامه و مجله ست...لورم ایپسوم متن ساختگی با تولید سادگی نامف...لورم
        ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت.....
      </p>
      <div className="w-full flex gap-x-5 my-4">
        <div className="w-[445px] h-[391px] rounded-[64px] bg-gray"></div>
        <div className="w-[534px] h-[391px] rounded-[64px] bg-gray"></div>
      </div>
      <h1 className="w-full text-2xl">
        بهترین سبک طراحی وبسایت در سال 2024 چیست ؟
      </h1>
      <p className="text-[#AAAAAA] leading-9">
        لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده
        از طراحان گرافیک است گرها و متون بلکه روزنامه و مجله در ست...لورم ایپسوم
        متن ساختگی با تولید سادگی نامف...لورم ایپسوم متن ساختگی با تولید سادگی
        نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است گرها و متون بلکه
        روزنامه و مجله ست...لورم ایپسوم متن ساختگی با تولید سادگی نامف...لورم
        ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت.....
      </p>
    </Fragment>
  );
};

export default About;
